Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 16, 7)]           0         
_________________________________________________________________
conv1d (Conv1D)              (None, 16, 128)           7296      
_________________________________________________________________
batch_normalization (BatchNo (None, 16, 128)           512       
_________________________________________________________________
re_lu (ReLU)                 (None, 16, 128)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 16, 64)            41024     
_________________________________________________________________
batch_normalization_1 (Batch (None, 16, 64)            256       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 16, 64)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 16, 32)            6176      
_________________________________________________________________
batch_normalization_2 (Batch (None, 16, 32)            128       
_________________________________________________________________
re_lu_2 (ReLU)               (None, 16, 32)            0         
_________________________________________________________________
global_average_pooling1d (Gl (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 2)                 66        
=================================================================
Total params: 55,458
Trainable params: 55,010
Non-trainable params: 448
_________________________________________________________________
--------------------
Selected Features: ['elevation', 'vel', 'acc', 'range', 'angularVel', 'radialVel', 'rcs']
Window_size:  16
Stride_size:  4
Best Hyperparameters: 15 {'CNN_1_filters': 128, 'layer1_kernel_size': 8, 'CNN_2_filters': 64, 'layer2_kernel_size': 5, 'CNN_3_filters': 32, 'layer3_kernel_size': 3}
